/******************************************************************************************************************************
COMMING SOON PAGE
*******************************************************************************************************************************/
(function($) {
    /**
    * Set your date here  (YEAR, MONTH (0 for January/11 for December), DAY, HOUR, MINUTE, SECOND)
    * according to the GMT+0 Timezone
    **/
    var launch = new Date(2016, 07, 20, 17, 00, 00);
    /**
    * The script
    **/
    var message = $('#message');
    var days = $('#days');
    var hours = $('#hours');
    var minutes = $('#minutes');
    var seconds = $('#seconds');
    
    setDate();
    function setDate(){
        var now = new Date();
        if( launch < now ){    
            message.html ('<h1> Just married! <span class="light"><i class="fa fa-plane"></i></span></h1>');       
            days.html('<h1></h1>');
            hours.html('<h1>20.08.2016</h1>');
            minutes.html('<h1></h1>');
            seconds.html('<h1></h1>');            
        }
        else{
            var s = -now.getTimezoneOffset()*60 + (launch.getTime() - now.getTime())/1000;
            var d = Math.floor(s/86400);
            /*days.html('<h1>'+d+'</h1><p>Día'+(d>1?'s':''),'</p>');*/
            days.html('<h1>'+d+'D</h1>');
            s -= d*86400;

            var h = Math.floor(s/3600);
            hours.html('<h1>'+h+'H</h1>');
            s -= h*3600;

            var m = Math.floor(s/60);
            minutes.html('<h1>'+m+'\'</h1>');

            s = Math.floor(s-m*60);
            seconds.html('<h1>'+s+'"</h1>');
            setTimeout(setDate, 1000);

            message.html('<h1>Despegamos en...<br>Startujemy za ...</h1>');
        }
    }
})(jQuery);
/******************************************************************************************************************************
ANIMATIONS
*******************************************************************************************************************************/

/******************************************************************************************************************************
SLIDER
*******************************************************************************************************************************/

/******************************************************************************************************************************
BOOTSTRAP
*******************************************************************************************************************************/
(function($) {
    "use strict";
        $('[data-rel=tooltip]').tooltip();
        $(".alert").alert();
})(jQuery);
/******************************************************************************************************************************
PROGRESS BAR
*******************************************************************************************************************************/
(function($) {
    "use strict";
    $("a.btn-progress").click(function(){
        $('#bar-container').slideToggle(); 
    });
})(jQuery);
